In [1]:
import pandas as pd

In [240]:
# Create a dictionary with names, cities, and states
dict1 = {'Name': ['Priyang Bhatt', 'Rashmin Panchal', 'Anil Rana', 'Rahul Patel'],
          'City': [' New York ', ' Los Angeles ', ' Chicago', ' Houston'],
          'State': ['NY', 'CA', 'IL', 'TX']}

# Convert the dictionary into a pandas DataFrame for easier data manipulation and analysis
data = pd.DataFrame(dict1)

In [5]:
data

              Name           City State
0    Priyang Bhatt      New York     NY
1  Rashmin Panchal   Los Angeles     CA
2        Anil Rana        Chicago    IL
3      Rahul Patel        Houston    TX

## 1. str.lower() and str.upper()

In [242]:
# Convert the 'Name' column to lowercase and store it in a new column 'name_lower'
data['name_lower'] = data['Name'].str.lower()

In [12]:
data

              Name           City State       name_lower
0    Priyang Bhatt      New York     NY    priyang bhatt
1  Rashmin Panchal   Los Angeles     CA  rashmin panchal
2        Anil Rana        Chicago    IL        anil rana
3      Rahul Patel        Houston    TX      rahul patel

In [244]:
# Convert the 'Name' column to uppercase and store the result in a new column 'name_upper'
data['name_upper'] = data['Name'].str.upper()

In [16]:
data

              Name           City State       name_lower       name_upper
0    Priyang Bhatt      New York     NY    priyang bhatt    PRIYANG BHATT
1  Rashmin Panchal   Los Angeles     CA  rashmin panchal  RASHMIN PANCHAL
2        Anil Rana        Chicago    IL        anil rana        ANIL RANA
3      Rahul Patel        Houston    TX      rahul patel      RAHUL PATEL

## 2. str.len()

In [246]:
# Calculate the length of each string in the 'Name' column of the DataFrame 'data'
data['Name'].str.len()

0    13
1    15
2     9
3    11
Name: Name, dtype: int64

In [248]:
# Calculate the length of each name in the 'Name' column
# and store the result in a new column 'Name_len'
data['Name_len'] = data['Name'].str.len()

In [24]:
data

,Name,City,State,name_lower,name_upper,Name_len
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11

## 3. str.strip()

In [250]:
# Accessing the 'City' column from the 'data' DataFrame
# Retrieving the first element (index 0) from the 'City' column
data['City'][0]

' New York '

In [39]:
data['City']

0        New York
1     Los Angeles
2          Chicago
3          Houston
Name: City, dtype: object

In [252]:
# Remove leading and trailing whitespace characters from the 'City' column in the DataFrame
data['City'].str.strip()

0       New York
1    Los Angeles
2        Chicago
3        Houston
Name: City, dtype: object

In [254]:
# Strip leading and trailing whitespace from the 'City' column
data['City_strip'] = data['City'].str.strip()

In [45]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston

In [47]:
data['City_strip'][0]

'New York'

## lstrip() and rstrip()

In [50]:
data['City'][0]

' New York '

In [52]:
data['city_lstrip']=data['City'].str.lstrip()

In [54]:
data['city_lstrip'][0]

'New York '

In [56]:
data['city_rstrip']=data['City'].str.rstrip()

In [58]:
data['city_rstrip'][0]

' New York'

## 4. str.split()

In [61]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [63]:
data[['First_name', 'Last_name']]=data['Name'].str.split(' ', expand=True)

In [65]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel

## 5. str.contains()

In [68]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [90]:
data[data['Name'].str.contains('Bhatt')]

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt

## 6.str.replace()

In [93]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel

In [95]:
data['State']

0    NY
1    CA
2    IL
3    TX
Name: State, dtype: object

In [97]:
data['State'].str.replace('NY', 'New York')

0    New York
1          CA
2          IL
3          TX
Name: State, dtype: object

In [99]:
data['State_replaced']= data['State'].str.replace('NY', 'New York')

In [101]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,CA
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX

In [103]:
data['State_replaced']= data['State'].str.replace('NY', 'New York').str.replace('CA', 'California')

In [105]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX

## 7. str.startswith() and str.endswith()

In [108]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX

In [110]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [112]:
data['Name'].str.startswith('P')

0     True
1    False
2    False
3    False
Name: Name, dtype: bool

In [114]:
data[data['Name'].str.startswith('P')]

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York

In [121]:
data[data['Last_name'].str.endswith('l')]

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX

In [123]:
data['ends_with_l']=data['Last_name'].str.endswith('l')

In [125]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced,ends_with_l
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California,True
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True

## 8.str.cat()

In [128]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced,ends_with_l
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California,True
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True

In [130]:
data['First_name'].str.cat(data['Last_name'], sep=' ')

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: First_name, dtype: object

In [132]:
data['Full_name']=data['First_name'].str.cat(data['Last_name'], sep=' ')

In [134]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced,ends_with_l,Full_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False,Priyang Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California,True,Rashmin Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False,Anil Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True,Rahul Patel

## 9.str.get()

In [151]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [153]:
data['Name'].str.get(0)

0    P
1    R
2    A
3    R
Name: Name, dtype: object

In [155]:
data['Name'].str.get(-1)

0    t
1    l
2    a
3    l
Name: Name, dtype: object

In [169]:
data['Name'].str.split().str.get(0)

0    Priyang
1    Rashmin
2       Anil
3      Rahul
Name: Name, dtype: object

## 10. str.slice()

In [172]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced,ends_with_l,Full_name
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False,Priyang Bhatt
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California,True,Rashmin Panchal
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False,Anil Rana
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True,Rahul Patel

In [178]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [182]:
data['Name'].str.slice(0, 3)

0    Pri
1    Ras
2    Ani
3    Rah
Name: Name, dtype: object

In [184]:
data['Name'].str.slice(2, 5)

0    iya
1    shm
2    il
3    hul
Name: Name, dtype: object

In [180]:
data['Name'].str.slice(-3)

0    att
1    hal
2    ana
3    tel
Name: Name, dtype: object

In [186]:
data['Name'].str.slice(0, 3) +' '+data['State']

0    Pri NY
1    Ras CA
2    Ani IL
3    Rah TX
dtype: object

In [214]:
data['name_state'] = data['Name'].str.slice(0, 3) +' '+data['State']

In [216]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced,ends_with_l,Full_name,name_state
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False,Priyang Bhatt,Pri NY
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California,True,Rashmin Panchal,Ras CA
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False,Anil Rana,Ani IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True,Rahul Patel,Rah TX

## 11. str.find()

In [219]:
data

,Name,City,State,name_lower,name_upper,Name_len,City_strip,city_lstrip,city_rstrip,First_name,Last_name,State_replaced,ends_with_l,Full_name,name_state
0,Priyang Bhatt,New York,NY,priyang bhatt,PRIYANG BHATT,13,New York,New York,New York,Priyang,Bhatt,New York,False,Priyang Bhatt,Pri NY
1,Rashmin Panchal,Los Angeles,CA,rashmin panchal,RASHMIN PANCHAL,15,Los Angeles,Los Angeles,Los Angeles,Rashmin,Panchal,California,True,Rashmin Panchal,Ras CA
2,Anil Rana,Chicago,IL,anil rana,ANIL RANA,9,Chicago,Chicago,Chicago,Anil,Rana,IL,False,Anil Rana,Ani IL
3,Rahul Patel,Houston,TX,rahul patel,RAHUL PATEL,11,Houston,Houston,Houston,Rahul,Patel,TX,True,Rahul Patel,Rah TX

In [225]:
data['Name']

0      Priyang Bhatt
1    Rashmin Panchal
2          Anil Rana
3        Rahul Patel
Name: Name, dtype: object

In [227]:
data['Name'].str.find('i')

0    2
1    5
2    2
3   -1
Name: Name, dtype: int64

In [229]:
data['Index_of_i']= data['Name'].str.find('i')

In [235]:
data[['Index_of_i']]

   Index_of_i
0           2
1           5
2           2
3          -1

In [237]:
data['Name'].str.rfind('a')

0    10
1    13
2     8
3     7
Name: Name, dtype: int64